{
    "metadata": {
        "total_size": 5138544640,
        "total_parameters": 2569272320
    },
    "weight_map": {
        "model.embed_tokens.weight": "model.safetensors",
        "model.embedding_norm.weight": "model.safetensors",
        "model.layers.0.conv.conv.weight": "model.safetensors",
        "model.layers.0.conv.in_proj.weight": "model.safetensors",
        "model.layers.0.conv.out_proj.weight": "model.safetensors",
        "model.layers.0.feed_forward.w1.weight": "model.safetensors",
        "model.layers.0.feed_forward.w2.weight": "model.safetensors",
        "model.layers.0.feed_forward.w3.weight": "model.safetensors",
        "model.layers.0.ffn_norm.weight": "model.safetensors",
        "model.layers.0.operator_norm.weight": "model.safetensors",
        "model.layers.1.conv.conv.weight": "model.safetensors",
        "model.layers.1.conv.in_proj.weight": "model.safetensors",
        "model.layers.1.conv.out_proj.weight": "model.safetensors",
        "model.layers.1.feed_forward.w1.weight": "model.safetensors",
        "model.layers.1.feed_forward.w2.weight": "model.safetensors",
        "model.layers.1.feed_forward.w3.weight": "model.safetensors",
        "model.layers.1.ffn_norm.weight": "model.safetensors",
        "model.layers.1.operator_norm.weight": "model.safetensors",
        "model.layers.10.conv.conv.weight": "model.safetensors",
        "model.layers.10.conv.in_proj.weight": "model.safetensors",
        "model.layers.10.conv.out_proj.weight": "model.safetensors",
        "model.layers.10.feed_forward.w1.weight": "model.safetensors",
        "model.layers.10.feed_forward.w2.weight": "model.safetensors",
        "model.layers.10.feed_forward.w3.weight": "model.safetensors",
        "model.layers.10.ffn_norm.weight": "model.safetensors",
        "model.layers.10.operator_norm.weight": "model.safetensors",
        "model.layers.11.conv.conv.weight": "model.safetensors",
        "model.layers.11.conv.in_proj.weight": "model.safetensors",
        "model.layers.11.conv.out_proj.weight": "model.safetensors",
        "model.layers.11.feed_forward.w1.weight": "model.safetensors",
        "model.layers.11.feed_forward.w2.weight": "model.safetensors",
        "model.layers.11.feed_forward.w3.weight": "model.safetensors",
        "model.layers.11.ffn_norm.weight": "model.safetensors",
        "model.layers.11.operator_norm.weight": "model.safetensors",
        "model.layers.12.conv.conv.weight": "model.safetensors",
        "model.layers.12.conv.in_proj.weight": "model.safetensors",
        "model.layers.12.conv.out_proj.weight": "model.safetensors",
        "model.layers.12.feed_forward.w1.weight": "model.safetensors",
        "model.layers.12.feed_forward.w2.weight": "model.safetensors",
        "model.layers.12.feed_forward.w3.weight": "model.safetensors",
        "model.layers.12.ffn_norm.weight": "model.safetensors",
        "model.layers.12.operator_norm.weight": "model.safetensors",
        "model.layers.13.feed_forward.w1.weight": "model.safetensors",
        "model.layers.13.feed_forward.w2.weight": "model.safetensors",
        "model.layers.13.feed_forward.w3.weight": "model.safetensors",
        "model.layers.13.ffn_norm.weight": "model.safetensors",
        "model.layers.13.operator_norm.weight": "model.safetensors",
        "model.layers.13.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.13.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.13.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.13.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.13.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.13.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.14.conv.conv.weight": "model.safetensors",
        "model.layers.14.conv.in_proj.weight": "model.safetensors",
        "model.layers.14.conv.out_proj.weight": "model.safetensors",
        "model.layers.14.feed_forward.w1.weight": "model.safetensors",
        "model.layers.14.feed_forward.w2.weight": "model.safetensors",
        "model.layers.14.feed_forward.w3.weight": "model.safetensors",
        "model.layers.14.ffn_norm.weight": "model.safetensors",
        "model.layers.14.operator_norm.weight": "model.safetensors",
        "model.layers.15.conv.conv.weight": "model.safetensors",
        "model.layers.15.conv.in_proj.weight": "model.safetensors",
        "model.layers.15.conv.out_proj.weight": "model.safetensors",
        "model.layers.15.feed_forward.w1.weight": "model.safetensors",
        "model.layers.15.feed_forward.w2.weight": "model.safetensors",
        "model.layers.15.feed_forward.w3.weight": "model.safetensors",
        "model.layers.15.ffn_norm.weight": "model.safetensors",
        "model.layers.15.operator_norm.weight": "model.safetensors",
        "model.layers.16.conv.conv.weight": "model.safetensors",
        "model.layers.16.conv.in_proj.weight": "model.safetensors",
        "model.layers.16.conv.out_proj.weight": "model.safetensors",
        "model.layers.16.feed_forward.w1.weight": "model.safetensors",
        "model.layers.16.feed_forward.w2.weight": "model.safetensors",
        "model.layers.16.feed_forward.w3.weight": "model.safetensors",
        "model.layers.16.ffn_norm.weight": "model.safetensors",
        "model.layers.16.operator_norm.weight": "model.safetensors",
        "model.layers.17.feed_forward.w1.weight": "model.safetensors",
        "model.layers.17.feed_forward.w2.weight": "model.safetensors",
        "model.layers.17.feed_forward.w3.weight": "model.safetensors",
        "model.layers.17.ffn_norm.weight": "model.safetensors",
        "model.layers.17.operator_norm.weight": "model.safetensors",
        "model.layers.17.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.17.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.17.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.17.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.17.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.17.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.18.conv.conv.weight": "model.safetensors",
        "model.layers.18.conv.in_proj.weight": "model.safetensors",
        "model.layers.18.conv.out_proj.weight": "model.safetensors",
        "model.layers.18.feed_forward.w1.weight": "model.safetensors",
        "model.layers.18.feed_forward.w2.weight": "model.safetensors",
        "model.layers.18.feed_forward.w3.weight": "model.safetensors",
        "model.layers.18.ffn_norm.weight": "model.safetensors",
        "model.layers.18.operator_norm.weight": "model.safetensors",
        "model.layers.19.conv.conv.weight": "model.safetensors",
        "model.layers.19.conv.in_proj.weight": "model.safetensors",
        "model.layers.19.conv.out_proj.weight": "model.safetensors",
        "model.layers.19.feed_forward.w1.weight": "model.safetensors",
        "model.layers.19.feed_forward.w2.weight": "model.safetensors",
        "model.layers.19.feed_forward.w3.weight": "model.safetensors",
        "model.layers.19.ffn_norm.weight": "model.safetensors",
        "model.layers.19.operator_norm.weight": "model.safetensors",
        "model.layers.2.feed_forward.w1.weight": "model.safetensors",
        "model.layers.2.feed_forward.w2.weight": "model.safetensors",
        "model.layers.2.feed_forward.w3.weight": "model.safetensors",
        "model.layers.2.ffn_norm.weight": "model.safetensors",
        "model.layers.2.operator_norm.weight": "model.safetensors",
        "model.layers.2.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.2.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.2.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.2.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.20.conv.conv.weight": "model.safetensors",
        "model.layers.20.conv.in_proj.weight": "model.safetensors",
        "model.layers.20.conv.out_proj.weight": "model.safetensors",
        "model.layers.20.feed_forward.w1.weight": "model.safetensors",
        "model.layers.20.feed_forward.w2.weight": "model.safetensors",
        "model.layers.20.feed_forward.w3.weight": "model.safetensors",
        "model.layers.20.ffn_norm.weight": "model.safetensors",
        "model.layers.20.operator_norm.weight": "model.safetensors",
        "model.layers.21.feed_forward.w1.weight": "model.safetensors",
        "model.layers.21.feed_forward.w2.weight": "model.safetensors",
        "model.layers.21.feed_forward.w3.weight": "model.safetensors",
        "model.layers.21.ffn_norm.weight": "model.safetensors",
        "model.layers.21.operator_norm.weight": "model.safetensors",
        "model.layers.21.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.21.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.21.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.21.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.21.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.21.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.22.conv.conv.weight": "model.safetensors",
        "model.layers.22.conv.in_proj.weight": "model.safetensors",
        "model.layers.22.conv.out_proj.weight": "model.safetensors",
        "model.layers.22.feed_forward.w1.weight": "model.safetensors",
        "model.layers.22.feed_forward.w2.weight": "model.safetensors",
        "model.layers.22.feed_forward.w3.weight": "model.safetensors",
        "model.layers.22.ffn_norm.weight": "model.safetensors",
        "model.layers.22.operator_norm.weight": "model.safetensors",
        "model.layers.23.conv.conv.weight": "model.safetensors",
        "model.layers.23.conv.in_proj.weight": "model.safetensors",
        "model.layers.23.conv.out_proj.weight": "model.safetensors",
        "model.layers.23.feed_forward.w1.weight": "model.safetensors",
        "model.layers.23.feed_forward.w2.weight": "model.safetensors",
        "model.layers.23.feed_forward.w3.weight": "model.safetensors",
        "model.layers.23.ffn_norm.weight": "model.safetensors",
        "model.layers.23.operator_norm.weight": "model.safetensors",
        "model.layers.24.feed_forward.w1.weight": "model.safetensors",
        "model.layers.24.feed_forward.w2.weight": "model.safetensors",
        "model.layers.24.feed_forward.w3.weight": "model.safetensors",
        "model.layers.24.ffn_norm.weight": "model.safetensors",
        "model.layers.24.operator_norm.weight": "model.safetensors",
        "model.layers.24.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.24.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.24.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.24.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.24.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.24.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.25.conv.conv.weight": "model.safetensors",
        "model.layers.25.conv.in_proj.weight": "model.safetensors",
        "model.layers.25.conv.out_proj.weight": "model.safetensors",
        "model.layers.25.feed_forward.w1.weight": "model.safetensors",
        "model.layers.25.feed_forward.w2.weight": "model.safetensors",
        "model.layers.25.feed_forward.w3.weight": "model.safetensors",
        "model.layers.25.ffn_norm.weight": "model.safetensors",
        "model.layers.25.operator_norm.weight": "model.safetensors",
        "model.layers.26.conv.conv.weight": "model.safetensors",
        "model.layers.26.conv.in_proj.weight": "model.safetensors",
        "model.layers.26.conv.out_proj.weight": "model.safetensors",
        "model.layers.26.feed_forward.w1.weight": "model.safetensors",
        "model.layers.26.feed_forward.w2.weight": "model.safetensors",
        "model.layers.26.feed_forward.w3.weight": "model.safetensors",
        "model.layers.26.ffn_norm.weight": "model.safetensors",
        "model.layers.26.operator_norm.weight": "model.safetensors",
        "model.layers.27.feed_forward.w1.weight": "model.safetensors",
        "model.layers.27.feed_forward.w2.weight": "model.safetensors",
        "model.layers.27.feed_forward.w3.weight": "model.safetensors",
        "model.layers.27.ffn_norm.weight": "model.safetensors",
        "model.layers.27.operator_norm.weight": "model.safetensors",
        "model.layers.27.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.27.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.27.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.27.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.27.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.27.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.28.conv.conv.weight": "model.safetensors",
        "model.layers.28.conv.in_proj.weight": "model.safetensors",
        "model.layers.28.conv.out_proj.weight": "model.safetensors",
        "model.layers.28.feed_forward.w1.weight": "model.safetensors",
        "model.layers.28.feed_forward.w2.weight": "model.safetensors",
        "model.layers.28.feed_forward.w3.weight": "model.safetensors",
        "model.layers.28.ffn_norm.weight": "model.safetensors",
        "model.layers.28.operator_norm.weight": "model.safetensors",
        "model.layers.29.conv.conv.weight": "model.safetensors",
        "model.layers.29.conv.in_proj.weight": "model.safetensors",
        "model.layers.29.conv.out_proj.weight": "model.safetensors",
        "model.layers.29.feed_forward.w1.weight": "model.safetensors",
        "model.layers.29.feed_forward.w2.weight": "model.safetensors",
        "model.layers.29.feed_forward.w3.weight": "model.safetensors",
        "model.layers.29.ffn_norm.weight": "model.safetensors",
        "model.layers.29.operator_norm.weight": "model.safetensors",
        "model.layers.3.conv.conv.weight": "model.safetensors",
        "model.layers.3.conv.in_proj.weight": "model.safetensors",
        "model.layers.3.conv.out_proj.weight": "model.safetensors",
        "model.layers.3.feed_forward.w1.weight": "model.safetensors",
        "model.layers.3.feed_forward.w2.weight": "model.safetensors",
        "model.layers.3.feed_forward.w3.weight": "model.safetensors",
        "model.layers.3.ffn_norm.weight": "model.safetensors",
        "model.layers.3.operator_norm.weight": "model.safetensors",
        "model.layers.4.conv.conv.weight": "model.safetensors",
        "model.layers.4.conv.in_proj.weight": "model.safetensors",
        "model.layers.4.conv.out_proj.weight": "model.safetensors",
        "model.layers.4.feed_forward.w1.weight": "model.safetensors",
        "model.layers.4.feed_forward.w2.weight": "model.safetensors",
        "model.layers.4.feed_forward.w3.weight": "model.safetensors",
        "model.layers.4.ffn_norm.weight": "model.safetensors",
        "model.layers.4.operator_norm.weight": "model.safetensors",
        "model.layers.5.feed_forward.w1.weight": "model.safetensors",
        "model.layers.5.feed_forward.w2.weight": "model.safetensors",
        "model.layers.5.feed_forward.w3.weight": "model.safetensors",
        "model.layers.5.ffn_norm.weight": "model.safetensors",
        "model.layers.5.operator_norm.weight": "model.safetensors",
        "model.layers.5.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.5.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.5.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.5.self_attn.v_proj.weight": "model.safetensors",
        "model.layers.6.conv.conv.weight": "model.safetensors",
        "model.layers.6.conv.in_proj.weight": "model.safetensors",
        "model.layers.6.conv.out_proj.weight": "model.safetensors",
        "model.layers.6.feed_forward.w1.weight": "model.safetensors",
        "model.layers.6.feed_forward.w2.weight": "model.safetensors",
        "model.layers.6.feed_forward.w3.weight": "model.safetensors",
        "model.layers.6.ffn_norm.weight": "model.safetensors",
        "model.layers.6.operator_norm.weight": "model.safetensors",
        "model.layers.7.conv.conv.weight": "model.safetensors",
        "model.layers.7.conv.in_proj.weight": "model.safetensors",
        "model.layers.7.conv.out_proj.weight": "model.safetensors",
        "model.layers.7.feed_forward.w1.weight": "model.safetensors",
        "model.layers.7.feed_forward.w2.weight": "model.safetensors",
        "model.layers.7.feed_forward.w3.weight": "model.safetensors",
        "model.layers.7.ffn_norm.weight": "model.safetensors",
        "model.layers.7.operator_norm.weight": "model.safetensors",
        "model.layers.8.conv.conv.weight": "model.safetensors",
        "model.layers.8.conv.in_proj.weight": "model.safetensors",
        "model.layers.8.conv.out_proj.weight": "model.safetensors",
        "model.layers.8.feed_forward.w1.weight": "model.safetensors",
        "model.layers.8.feed_forward.w2.weight": "model.safetensors",
        "model.layers.8.feed_forward.w3.weight": "model.safetensors",
        "model.layers.8.ffn_norm.weight": "model.safetensors",
        "model.layers.8.operator_norm.weight": "model.safetensors",
        "model.layers.9.feed_forward.w1.weight": "model.safetensors",
        "model.layers.9.feed_forward.w2.weight": "model.safetensors",
        "model.layers.9.feed_forward.w3.weight": "model.safetensors",
        "model.layers.9.ffn_norm.weight": "model.safetensors",
        "model.layers.9.operator_norm.weight": "model.safetensors",
        "model.layers.9.self_attn.k_layernorm.weight": "model.safetensors",
        "model.layers.9.self_attn.k_proj.weight": "model.safetensors",
        "model.layers.9.self_attn.out_proj.weight": "model.safetensors",
        "model.layers.9.self_attn.q_layernorm.weight": "model.safetensors",
        "model.layers.9.self_attn.q_proj.weight": "model.safetensors",
        "model.layers.9.self_attn.v_proj.weight": "model.safetensors"
    }
}